
ПодключитьСценарий("..\src\BSLParser\Ext\ObjectModule.bsl", "ПарсерBSL");
ПодключитьСценарий("..\plugins\TestVars\src\TestVars\Ext\ObjectModule.bsl", "ПлагинТестПеременных");

КаталогОбщихМодулей = АргументыКоманднойСтроки[0];
Файлы = НайтиФайлы(КаталогОбщихМодулей, "*.bsl", Истина);

ПарсерBSL = Новый ПарсерBSL;
ПлагинТестПеременных = Новый ПлагинТестПеременных;
ПарсерBSL.Подключить(ПлагинТестПеременных);

ЧтениеТекста = Новый ЧтениеТекста;

Для каждого Файл Из Файлы Цикл
	//Сообщить(Символы.ПС);
	Сообщить(Файл.ПолноеИмя);
	ЧтениеТекста.Открыть(Файл.ПолноеИмя);
	Исходник = ЧтениеТекста.Прочитать();
	Попытка
		Модуль = ПарсерBSL.РазобратьМодуль(Исходник);
		ПарсерBSL.ПосетитьМодуль(Модуль);
	Исключение
		Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	Сообщить(ПлагинТестПеременных.Результат());
	ЧтениеТекста.Закрыть()
КонецЦикла;